export const errorsEnum = {
  // BAD_REQUEST

  4000: {
    en: 'BAD_REQUEST',
    ua: 'Запит невірний',
    ru: 'Запрос неверный',
  },

  // BAD_REQUEST - JOI

  4001: {
    en: 'Wrong fields',
    ua: 'Невірно заповнено поля',
    ru: 'Неверно заполнены поля',
  },

  // BAD REQUEST - AUTH

  4002: {
    en: 'WRONG_EMAIL_OR_PASSWORD',
    ua: 'Невірно вказано пошту або пароль',
    ru: 'Неверно указаны почта или пароль',
  },

  4003: {
    en: 'ACCESS_TOKEN_IS_REQUIRED',
    ua: 'Необхідний токен доступу',
    ru: 'Необходим токен доступа',
  },

  4004: {
    en: 'REFRESH_TOKEN_IS_REQUIRED',
    ua: 'Необхідний токен оновлення',
    ru: 'Необходим токен обновления',
  },

  4005: {
    en: 'Incorrect action',
    ua: 'Невірна дія',
    ru: 'Недопустимое действие',
  },

  4006: {
    en: 'Incorrect user',
    ua: 'Деякі поля користувача заповнені невірно',
    ru: 'Некоторые поля пользователя заполнены неверно',
  },

  // USER todo

  4007: {
    en: 'No user',
    ua: 'Користувача не знайдено',
    ru: 'Пользователь не найден',
  },

  4008: {
    en: 'No user',
    ua: 'Користувачів не знайдено',
    ru: 'Пользователи не найдены',
  },

  4009: {
    en: 'No user',
    ua: 'Користувач з такою поштою вже є',
    ru: 'Пользователь с такой почтой уже есть',
  },

  // BAD_REQUEST - DOCS

  40010: {
    en: 'This doc is too large',
    ua: 'Даний документ занадто великий',
    ru: 'Данный документ слишком большой',
  },

  40011: {
    en: 'This photo is too large',
    ua: 'Дане фото занадто велике',
    ru: 'Данное фото слишком большое',
  },

  40012: {
    en: 'This video is too large',
    ua: 'Дане відео занадто велике',
    ru: 'Данное видео слишком большое',
  },

  40013: {
    en: 'This file is unknown',
    ua: 'Неприпустимий тип файлів',
    ru: 'Недопустимый тип файлов',
  },

  40014: {
    en: 'Not valid photo type',
    ua: 'Неприпустимий тип фото',
    ru: 'Недопустимый тип фото',
  },

  // BAD REQUEST - MUTUAL

  40015: {
    en: 'Some fields are empty',
    ua: 'Деякі поля незаповнені',
    ru: 'Некоторые поля незаполнены',
  },

  40016: {
    en: 'INVALID_ID',
    ua: 'Невірно вказано ID',
    ru: 'Неверно указан ID',
  },

  // AUTH -UNAUTHORIZED

  4010: {
    en: 'UNAUTHORIZED',
    ua: 'Вас неавторизовано',
    ru: 'Вы - неавторизованы',
  },


  4011: {
    en: 'ACCESS_TOKEN_IS_NOT_VALID',
    ua: 'Невалідний токен доступу',
    ru: 'Невалидный токен доступа',
  },

  4012: {
    en: 'REFRESH_TOKEN_IS_NOT_VALID',
    ua: 'Невалідний токен оновлення',
    ru: 'Невалидный токен обновления',
  },

  // AUTH - FORBIDDEN

  4031: {
    en: 'ACCESS_TOKEN_IS_NOT_VERIFIED',
    ua: 'Не варифіковано токен доступу',
    ru: 'Неварифицирован токен доступа',
  },

  4032: {
    en: 'REFRESH_TOKEN_IS_NOT_VERIFIED',
    ua: 'Не варифіковано токен оновлення',
    ru: 'Неварифицирован токен обновления',
  },

  // NOT FOUND

  4041: {
    en: 'RECORD NOT FOUND',
    ua: 'ІНФО-ЗАПИС НЕ ЗНАЙДЕНО',
    ru: 'ИНФО-ЗАПИСЬ НЕ НАЙДЕНА',
  },
};
